#include <stdio.h>
#define size 7

int main(){

int n, k=0;

int a[size]= {500,1000,2000,3000,4000,5000,6000};//Кількість пам'яті в гігабайтах
int b[size]= {525,1500,2169,2879,4000,4339,5000};//Вартість

printf("\nВведіть мінімальну вартість вінчестера для пошуку на складі:\n\nВартість = ");
scanf("%d",&n);

for(int i = 0; i < size; i++)
{
  if (b[i]>n)
  {
    k++;
  }
}

  if (k!=0)
  {
    printf("\nОбсяг пам'яті та ціна тих вінчестерів, вартість яких більша за %d грн.:\n", n);
    for (int j = 0; j < size; j++)
    { 
      if (b[j]>n)
      {
        printf("\n %6dGB  -%6d грн.", a[j], b[j]);
      }
    }
    printf("\n");
  } else printf("\nВінчестерів дорожчих за %d грн. на складі немає\n", n);
}
